# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд 
# и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, 
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

n = (input('Введите шеститизначное число: '))
a = int(n[0:3])
b = int(n[3:6])
a1 = a//100
a2 = a//10%10
a3 = a%10
s1 = (a1+a2+a3)

b1 = b//100
b2 = b//10%10
b3 = b%10
s2 = (b1+b2+b3)

if (s1==s2):
    print ('yes')
else:
    print ('no')




